In [1]:
# This is to avoid error when running Hands-on Lab on third-party tool.
# Unable to connect:  [IBM][CLI Driver] SQL10013N  The specified library "GSKit Error: 207" could not be loaded.  SQLSTATE=42724 SQLCODE=-10013
# source: https://github.com/ibmdb/python-ibmdb/issues/650

# !pip install sqlalchemy==1.3.9
# !pip install ibm_db_sa
# !pip install ipython-sql

In [2]:
%load_ext sql

In [3]:
# Enter the connection string for your Db2 on Cloud database instance below
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL
%sql ibm_db_sa://sbq39922:<PASSWORD>@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb?security=SSL

In [4]:
# retrieve list of all tables in the database for your db2 schema (username)

%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES \
     where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC')

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('SBQ39922', 'PETSALE', datetime.datetime(2021, 9, 30, 16, 57, 32, 974730)),
 ('SBQ39922', 'EMPLOYEES', datetime.datetime(2021, 9, 30, 17, 16, 34, 506400)),
 ('SBQ39922', 'JOB_HISTORY', datetime.datetime(2021, 9, 30, 17, 16, 34, 616621)),
 ('SBQ39922', 'JOBS', datetime.datetime(2021, 9, 30, 17, 16, 34, 742614)),
 ('SBQ39922', 'DEPARTMENTS', datetime.datetime(2021, 9, 30, 17, 16, 34, 867631)),
 ('SBQ39922', 'LOCATIONS', datetime.datetime(2021, 9, 30, 17, 16, 34, 992048)),
 ('SBQ39922', 'PETRESCUE', datetime.datetime(2021, 10, 8, 14, 30, 16, 492096)),
 ('SBQ39922', 'INSTRUCTOR', datetime.datetime(2021, 10, 8, 20, 53, 19, 796647)),
 ('SBQ39922', 'INTERNATIONAL_STUDENT_TEST_SCORES', datetime.datetime(2021, 10, 8, 21, 20, 34, 296727)),
 ('SBQ39922', 'CHICAGO_SOCIOECONOMIC_DATA', datetime.datetime(2021, 10, 9, 8, 47, 35, 352945)),
 ('SBQ39922', 'SCHOOLS', datetime.datetime(2021, 10, 9, 9, 45, 18, 249512)),
 ('SBQ39922', 'CHICAGO_PUBLIC_SCHOOLS', datetime.datetime(2021, 10, 9, 11, 29, 29, 655613)),
 ('SBQ39922', 'CENSUS_DATA', datetime.datetime(2021, 10, 9, 11, 30, 44, 87836)),
 ('SBQ39922', 'CHICAGO_CRIME_DATA', datetime.datetime(2021, 10, 9, 11, 31, 59, 404494))]

In [22]:
%%sql
select * from jobs

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('100      ', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('200      ', 'Sr.Software Dev', Decimal('60000.00'), Decimal('80000.00')),
 ('220      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('234      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('300      ', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('400      ', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('500      ', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('600      ', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('650      ', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('660      ', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00'))]

In [18]:
%%sql
select * from employees

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        '),
 ('E1006    ', 'Nancy', 'Allen', '123411   ', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600      ', Decimal('90000.00'), '30001    ', '2        '),
 ('E1007    ', 'Mary', 'Thomas', '123412   ', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1008    ', 'Bharath', 'Gupta', '123413   ', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1009    ', 'Andrea', 'Jones', '123414   ', datetime.date(1990, 7, 9), 'F', '120 Fall Creek, Gary,IL', '234      ', Decimal('70000.00'), '30003    ', '7        '),
 ('E1010    ', 'Ann', 'Jacob', '123415   ', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220      ', Decimal('70000.00'), '30004    ', '5        ')]

###  Exercise 1: Create a View

In [20]:
%%sql
create view empsalary
as select emp_id, f_name, l_name, b_date, sex, salary
from employees

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: Statement Execute Failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0601N  The name of the object to be created is identical to the existing name "SBQ39922.EMPSALARY" of type "VIEW".  SQLSTATE=42710 SQLCODE=-601
[SQL: create view empsalary as
select emp_id, f_name, l_name, b_date, sex, salary
from employees]
(Background on this error at: http://sqlalche.me/e/f405)

In [21]:
%%sql
SELECT * FROM empsalary;

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', 'John', 'Thomas', datetime.date(1976, 1, 9), 'M', Decimal('100000.00')),
 ('E1002    ', 'Alice', 'James', datetime.date(1972, 7, 31), 'F', Decimal('80000.00')),
 ('E1003    ', 'Steve', 'Wells', datetime.date(1980, 8, 10), 'M', Decimal('50000.00')),
 ('E1004    ', 'Santosh', 'Kumar', datetime.date(1985, 7, 20), 'M', Decimal('60000.00')),
 ('E1005    ', 'Ahmed', 'Hussain', datetime.date(1981, 1, 4), 'M', Decimal('70000.00')),
 ('E1006    ', 'Nancy', 'Allen', datetime.date(1978, 2, 6), 'F', Decimal('90000.00')),
 ('E1007    ', 'Mary', 'Thomas', datetime.date(1975, 5, 5), 'F', Decimal('65000.00')),
 ('E1008    ', 'Bharath', 'Gupta', datetime.date(1985, 5, 6), 'M', Decimal('65000.00')),
 ('E1009    ', 'Andrea', 'Jones', datetime.date(1990, 7, 9), 'F', Decimal('70000.00')),
 ('E1010    ', 'Ann', 'Jacob', datetime.date(1982, 3, 30), 'F', Decimal('70000.00'))]

### Update a View

In [23]:
%%sql
create or replace view empsalary
as select emp_id, f_name, l_name, b_date, sex, job_title, min_salary, max_salary
from employees, jobs
where employees.job_id = jobs.job_ident

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[]

In [24]:
%%sql
select * from empsalary

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', 'John', 'Thomas', datetime.date(1976, 1, 9), 'M', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('E1002    ', 'Alice', 'James', datetime.date(1972, 7, 31), 'F', 'Sr.Software Dev', Decimal('60000.00'), Decimal('80000.00')),
 ('E1003    ', 'Steve', 'Wells', datetime.date(1980, 8, 10), 'M', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('E1004    ', 'Santosh', 'Kumar', datetime.date(1985, 7, 20), 'M', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('E1005    ', 'Ahmed', 'Hussain', datetime.date(1981, 1, 4), 'M', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('E1006    ', 'Nancy', 'Allen', datetime.date(1978, 2, 6), 'F', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('E1007    ', 'Mary', 'Thomas', datetime.date(1975, 5, 5), 'F', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1008    ', 'Bharath', 'Gupta', datetime.date(1985, 5, 6), 'M', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1009    ', 'Andrea', 'Jones', datetime.date(1990, 7, 9), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('E1010    ', 'Ann', 'Jacob', datetime.date(1982, 3, 30), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))]

### Drop a View

In [25]:
%%sql
drop view empsalary

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[]

In [26]:
select * from empsalary

SyntaxError: invalid syntax (<ipython-input-26-51d7faee9a8c>, line 1)